from thefuzz import fuzz
import unicodedata
import string
import tamil

file_map = {
    "முகவரி": "முகவரி.gif",
    "அகமதாபாத்": "அகமதாபாத்.gif",
    "அனைத்தும்": "அனைத்தும்.gif",
    "ஏதேனும் கேள்விகள்": "ஏதேனும் கேள்விகள்.gif",
    "நீங்கள் கோபமாக இருக்கிறீர்களா": "நீங்கள் கோபமாக இருக்கிறீர்களா.gif",
    "நீங்கள் பிஸியாக இருக்கிறீர்களா": "நீங்கள் பிஸியாக இருக்கிறீர்களா.gif",
    "உங்களுக்கு பசிக்கிறதா": "உங்களுக்கு பசிக்கிறதா.gif",
    "அசாம்": "அசாம்.gif",
    "ஆகஸ்ட்": "ஆகஸ்ட்.gif",
    "வாழைப்பழம்": "வாழைப்பழம்.gif",
    "பனாரஸ்": "பனாரஸ்.gif",
    "பெங்களூரு": "பெங்களூரு.gif",
    "கவனமாக இருங்கள்": "கவனமாக இருங்கள்.gif",
    "பாலம்": "பாலம்.gif",
    "பூனை": "பூனை.gif",
    "கிறிஸ்துமஸ்": "கிறிஸ்துமஸ்.gif",
    "தேவாலயம்": "தேவாலயம்.gif",
    "கிளினிக்": "கிளினிக்.gif",
    "தசரா": "தசரா.gif",
    "டிசம்பர்": "டிசம்பர்.gif",
    "நீங்கள் உங்களது வீட்டுப்பாடத்தை முடித்துவிட்டீர்களா": "நீங்கள் உங்களது வீட்டுப்பாடத்தை முடித்துவிட்டீர்களா.gif",
    "உங்களிடம் பணம் இருக்கிறதா": "உங்களிடம் பணம் இருக்கிறதா.gif",
    "நீங்கள் குடிக்க ஏதாவது வேண்டுமா": "நீங்கள் குடிக்க ஏதாவது வேண்டுமா.gif",
    "நீங்கள் தொலைக்காட்சியை பார்க்கிறீர்களா": "நீங்கள் தொலைக்காட்சியை பார்க்கிறீர்களா.gif",
    "கவலைப்பட வேண்டாம்": "கவலைப்பட வேண்டாம்.gif",
    "பூ அழகாக இருக்கிறது": "பூ அழகாக இருக்கிறது.gif",
    "மதிய வணக்கம்": "மதிய வணக்கம்.gif",
    "காலை வணக்கம்": "காலை வணக்கம்.gif",
    "நல்ல கேள்வி": "நல்ல கேள்வி.gif",
    "திராட்சை": "திராட்சை.gif",
    "வணக்கம்": "வணக்கம்.gif",
    "இந்து": "இந்து.gif",
    "ஹைதராபாத்": "ஹைதராபாத்.gif",
    "நான் எழுத்தர்": "நான் எழுத்தர்.gif",
    "நான் நன்றாக இருக்கிறேன்": "நான் நன்றாக இருக்கிறேன்.gif",
    "மன்னிக்கவும்": "மன்னிக்கவும்.gif",
    "நான் யோசித்துக்கொண்டு இருக்கிறேன்": "நான் யோசித்துக்கொண்டு இருக்கிறேன்.gif",
    "நான் சோர்வாக இருக்கிறேன்": "நான் சோர்வாக இருக்கிறேன்.gif",
    "நான் திரையரங்கத்திற்கு செல்கிறேன்": "நான் திரையரங்கத்திற்கு செல்கிறேன்.gif",
    "நான் ஏதாவது சொல்ல வேண்டும் என்று நினைத்தேன் ஆனால் மறந்துவிட்டேன்": "நான் ஏதாவது சொல்ல வேண்டும் என்று நினைத்தேன் ஆனால் மறந்துவிட்டேன்.gif",
    "எனக்கு இளஞ்சிவப்பு நிறம் பிடிக்கும்": "எனக்கு இளஞ்சிவப்பு நிறம் பிடிக்கும்.gif",
    "எனக்கு ஷாப்பிங் செல்ல பிடிக்கும்": "எனக்கு ஷாப்பிங் செல்ல பிடிக்கும்.gif",
    "வேலை": "வேலை.gif",
    "ஜூலை": "ஜூலை.gif",
    "ஜூன்": "ஜூன்.gif",
    "கர்நாடகா": "கர்நாடகா.gif",
    "கேரளா": "கேரளா.gif",
    "கிருஷ்ணா": "கிருஷ்ணா.gif",
    "மதிய உணவுக்கு செல்லலாம்": "மதிய உணவுக்கு செல்லலாம்.gif",
    "மாங்கனி": "மாங்கனி.gif",
    "மே": "மே.gif",
    "மைல்": "மைல்.gif",
    "மும்பை": "மும்பை.gif",
    "நாக்பூர்": "நாக்பூர்.gif",
    "உங்களை சந்திப்பது மகிழ்ச்சியாக உள்ளது": "உங்களை சந்திப்பது மகிழ்ச்சியாக உள்ளது.gif",
    "கதவை திறக்கவும்": "கதவை திறக்கவும்.gif",
    "பாகிஸ்தான்": "பாகிஸ்தான்.gif",
    "தயவுசெய்து எனக்கு பிறகு அழைக்கவும்": "தயவுசெய்து எனக்கு பிறகு அழைக்கவும்.gif",
    "தயவுசெய்து சிறிது நேரம் காத்திருக்கவும்": "தயவுசெய்து சிறிது நேரம் காத்திருக்கவும்.gif",
    "காவல் நிலையம்": "காவல் நிலையம்.gif",
    "அஞ்சல் அலுவலகம்": "அஞ்சல் அலுவலகம்.gif",
    "புனே": "புனே.gif",
    "பஞ்சாப்": "பஞ்சாப்.gif",
    "சனிக்கிழமை": "சனிக்கிழமை.gif",
    "நான் உங்களுக்கு உதவலாமா": "நான் உங்களுக்கு உதவலாமா.gif",
    "நாம் நாளை சேர்ந்து செல்லலாமா": "நாம் நாளை சேர்ந்து செல்லலாமா.gif",
    "கடை": "கடை.gif",
    "கை குறி மொழி மொழிபெயர்ப்பாளர்": "கை குறி மொழி மொழிபெயர்ப்பாளர்.gif",
    "உட்காரவும்": "உட்காரவும்.gif",
    "எழுந்திருங்கள்": "எழுந்திருங்கள்.gif",
    "கவனித்து கொள்ளுங்கள்": "கவனித்து கொள்ளுங்கள்.gif",
    "கோவில்": "கோவில்.gif",
    "போக்குவரத்து நெரிசல் இருந்தது": "போக்குவரத்து நெரிசல் இருந்தது.gif",
    "வியாழக்கிழமை": "வியாழக்கிழமை.gif",
    "கழிவறை": "கழிவறை.gif",
    "தக்காளி": "தக்காளி.gif",
    "செவ்வாய்க்கிழமை": "செவ்வாய்க்கிழமை.gif",
    "அமெரிக்கா": "அமெரிக்கா.gif",
    "கிராமம்": "கிராமம்.gif",
    "புதன்கிழமை": "புதன்கிழமை.gif",
    "நீங்கள் என்ன செய்கிறீர்கள்": "நீங்கள் என்ன செய்கிறீர்கள்.gif",
    "என்ன பிரச்சனை": "என்ன பிரச்சனை.gif",
    "இன்று தேதியானது என்ன": "இன்று தேதியானது என்ன.gif",
    "உங்கள் தந்தை என்ன செய்கிறார்": "உங்கள் தந்தை என்ன செய்கிறார்.gif",
    "உங்கள் கைபேசி எண் என்ன": "உங்கள் கைபேசி எண் என்ன.gif",
    "உங்கள் பெயர் என்ன": "உங்கள் பெயர் என்ன.gif",
    "என்ன ஆச்சு": "என்ன ஆச்சு.gif",
    "கழிவறை எங்கு உள்ளது": "கழிவறை எங்கு உள்ளது.gif",
    "காவல் நிலையம் எங்கு உள்ளது": "காவல் நிலையம் எங்கு உள்ளது.gif",
    "நீங்கள் தவறாக உள்ளீர்கள்": "நீங்கள் தவறாக உள்ளீர்கள்.gif"
}

def normalize_tamil_text(text):
    return unicodedata.normalize('NFC', text)

def transcribe_audio(audio_path, model):
    result = model.transcribe(audio_path, language="ta")
    tamil_text = normalize_tamil_text(result["text"].strip())
    return tamil_text.translate(str.maketrans('', '', string.punctuation))

def find_best_match(tamil_text, min_score=75):
    best_match = None
    best_score = 0
    for key in file_map.keys():
        score = fuzz.ratio(tamil_text, key)
        if score > best_score:
            best_match = key
            best_score = score
    return (file_map[best_match], best_score) if best_score >= min_score else (None, 0)

def split_tamil_graphemes(text):
    return tamil.utf8.get_letters(text)
